Revit 2026 API

# RailingTypeSecondaryHandrailHeight Property

---

The height of the secondary handrail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SecondaryHandrailHeight { get; }
```
```vb
Public ReadOnly Property SecondaryHandrailHeight As Double
	Get
```
```cpp
public:
property double SecondaryHandrailHeight {
	double get ();
}
```
```fsharp
member SecondaryHandrailHeight : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The rail has no secondary hand rail. |

#### Reference

RailingType Class

Autodesk.Revit.DB.Architecture Namespace